Repository: f-leoni/lyrics2
Catalog: lib/l10n/app_*.arb
Languages: it

# searchHint
source: Text, author, title, ...
it: Cerca per autore, titolo, testo, ...

# searchText
source: Search
it: Cerca

source: Getting Started
it: Introduzione

# onboardingSearch
source: Search your favorite song by title and/or by author!
it: Cerca la tua canzone preferita per titolo e/o per autore!

# onboardingAdd
source: Add your song to favorites!
it: Aggiungi la tua canzone ai preferiti!

# onboardingCome
source: Come back to Lyrics App and sing!
it: Accedi all'app e canta!

source: Nothing here!
it: Non c'è ancora nulla!

# emptyFavsLine1
source: Add some favorites!
it: Aggiungi i tuoi testi preferiti!

# emptyFavsLine2
source: Tap the button to search for some lyrics!
it: Tocca il pulsante per cercare il testo delle tue canzoni

# somethingWrong
source: Something went wrong!
it: Qualcosa è andato storto!

# username
source: ðŸŽ­ Username
it: 🎭 username

# password
source: ðŸŽ¹ Password
it: 🎹 password

# lblFavs
source: Favorites
it: Preferiti

# lblSearch
source: Search
it: Cerca

# errNoLyric
source: An error occurred: lyric can't be retrieved
it: Si è verificato un errore: impossibile accedere al testo

# splashInit
source: Initializing...
it: Inizializzazione...

# info
source: Lyrics 2 was created by Zitzusoft. It is an open source app and uses some code from RayWenderlicht's very good course 'Flutter Apprentice'. Also, Lyrics 2 uses some third party libraries. In appearance order: - provider - smooth_page_indicator - xml2json - logger - flutter_acrcloud - sqflite - package_info_plus - firebase_core + cloud + auth - genius_api_unofficial - beautiful_soup_dart animated_toggle_switch nowplaying (hope I didn't forget anyone!) Finally, Lyrics 2 leverages APIs from ChartLyrics and Genius, but is not related in any way with these services Thanks all! F. of Zitzusoft
it: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed luctus congue vulputate. Nulla semper dapibus neque nec feugiat. Ut eu consectetur nisl. In iaculis sapien id orci iaculis, quis tempus nibh ultrices. Orci varius natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Ut vel leo nulla. Curabitur ultricies nibh quis enim dapibus porta. Aenean varius sodales metus et auctor. Fusce commodo eros vel varius porttitor. Nullam eu dictum ipsum. Nulla lacus urna, consectetur nec suscipit eu, vehicula nec mi. Integer tincidunt, orci et eleifend eleifend, felis ipsum blandit magna, id aliquam mi nibh at arcu. Proin pellentesque turpis non nisi commodo rhoncus. Sed varius ante sagittis molestie porta. Mauris posuere luctus libero, vel sagittis turpis efficitur non. Nulla facilisi. Ut at nibh et urna pellentesque vestibulum id ac urna. Donec blandit ligula vel fringilla imperdiet. Vivamus ultrices blandit sapien, vel rhoncus massa gravida in. Sed eu magna sem. Pellentesque efficitur vulputate euismod. Mauris at sem quis quam volutpat ornare eget eu lectus. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Ut finibus sagittis sollicitudin. Suspendisse id justo ac urna sollicitudin bibendum. Cras porttitor pulvinar ex vel porttitor. Vivamus semper, sapien vitae tristique fermentum, elit metus fermentum nibh, et pretium dui lorem ac dui. Etiam a mauris dui. Quisque condimentum arcu dui. Cras accumsan nibh magna, et convallis dui commodo eget. Proin sed bibendum tellus. Vivamus scelerisque vitae tortor finibus cursus. In dapibus ipsum a gravida suscipit. Nullam ac varius urna, a dapibus ipsum. Nullam venenatis enim ac ultricies tristique. Maecenas viverra pulvinar turpis, in fringilla urna fringilla a. In pharetra sem ac magna ultricies vestibulum. Pellentesque justo velit, porttitor sit amet pellentesque sit amet, efficitur vel ligula. Suspendisse sagittis mollis suscipit. Duis ut bibendum risus, a ullamcorper nunc. Integer ornare diam at ipsum sollicitudin molestie. Praesent dapibus nisi mi. Suspendisse semper tincidunt ligula, eu molestie ante volutpat sit amet. Proin sit amet commodo arcu. Duis pretium nisi sed elit iaculis condimentum. Aenean varius sapien at elit finibus ultrices. Integer venenatis, diam vitae fermentum accumsan, turpis tellus scelerisque libero, sed dictum mi odio a orci. Proin felis sem, venenatis eget feugiat quis, gravida et diam. Vestibulum eget venenatis ante. Quisque faucibus pretium sem eget laoreet. Sed molestie nulla eu commodo lacinia. Integer sit amet justo elementum, consequat lacus a, rutrum dui. Nunc vitae ante nec quam aliquam vehicula a ut erat.

# infoTitle
source: Lyrics 2 Info
it: Lyrics 2 Informazioni
